const express = require('express')
const app = express()

// Middleware (read what inside Post)
app.use(express.json())

// بنستفيد من هذا الكلام لما نتعامل مع api يصير نرجع داتا معينة
// احنا لسا ما اخذنا شيء عن الداتا بيس لكن نفترض ان الداتابيس عبارة عن ارراي موجودة عندنا يصير نرجع هذا الأرراي بطريقة معينة
// for example
const db = [
    {fName:'Mohammad',favFood: 'Mandi Lamb'},
    {fName:'Ahmed',favFood: 'Pizza'},
    {fName:'Omar',favFood: 'Kudo Sandwich'},
    {fName:'Saeed',favFood: 'Manto'},
    {fName:'Hassan',favFood: 'Indomie'},
]
// نبغا نرجع هذي الداتا بالميثود الجيت والبوست والبوت والديليت نتعامل معاهم
// نشوف الهرجة سوا
// GET /all  RES all the data
app.get('/all',(req,res)=>{
    res.json(db)
})
// نروح لأداة بوستمان ونختار الميثود جيت والباث الي هو /all 
// بالتالي رجعت لي الأرراي الي كتبتها فوق ال db 
// مثال ثاني . نبغاه يرجعلنا اول عنصر
app.get('/elem1',(req,res)=>{
    res.json(db[0])
})
// بعد ما نضغط سيند بالبوستمان بيطلعلنا النتيجة الي نبغاها وهو الأوبجكت الأول بالأرراي db 
// {fName:'Mohammad',favFood: 'Mandi Lamb'}
// بنغير الميثود الي بداخل البودي من سيند إلى جيسون حتى نتأكد انه يروح للجيسون وهي الصيغة الأفضل, السيند مو دايماً بتشتغل بخصوص الأوبجكت والمعلومات الفعلية

// ##########################################################################

// طيب الجيت وخلصنا منه الأن نروح للبوست
// نبغا نضيف لهذي الأرراي نروح على البوست . الجيت نستخدمه حتى ناخذ داتا , مثلاً ابغا اخذ العنصر الأول ابغا اخذ العنصر الأخير او اسماء كل اليوسرات وهكذا
// المهم هذا مثال على البوست 
// يقولك اذا تبغا تتعامل مع البوست في حاجة اسمها ميدلوير موديول فنكشن 
// يحتاج تنزل احد الموديل وير المشهورة اسمه بودي بارسير body-parser
// المصدر هذا الموقع https://codeforgeek.com/handle-get-post-request-express-4/
// يقول الأستاذ مافي داعي اننا نستخدم هذي البارسير نستخدم الميدلوير الحالية الي هي اليوس use() حتى قبل تعمل اي ريكويست تتأكد امورك تمام
// التغيير بالسطر رقم 5
app.get('/firstElem',(req,res)=>{
    res.json(db[0])
})





// ##########################################################################

// app.get('/',(req, res)=>{
//     // localhost:PORT/endpoint
//     // localhost:3000/test  نضع هذا الرابط بالمتصفح
//     res.send('GET Request and this is the response')
// })

app.listen(3000, () => {
    console.log('Server is working ...')
})

// npm i -g nodemon
// تعني تنزيل المكتبة بشكل عام
// المهم هذا النودمون يقفل ويشتغل ثاني عند كل تغيير
// تشغل النودمون بهذي الطريقة nodemon filename.js
// عفواً في ممكن شغلات مافهمتها نشوف ايش هرجته بعدين على خير ان شاء الله


// من ملف باكيج جيسون بداخل مفتاح السكربت نعرف اسم السكربت والقيمة حقته الوظيفة الي بيقوم بيها زي مثلاً
// "Mohammad" : "pwd" والذي بدوره يعرضلي المكان الي انا فيه 
// npm run script
// npm run Mohammad

// ##########################################################################

// post request
// يتم تجربة مثل هذا الكود ليس على المتصفح بل على اداة تدعى بوستمان postman
// البوستمان هو عبارة عن اداة لتجربة api الموجودة بالسيرفر الخاص بنا
// زي كأنو البوستمان بيرسل ركويست للسيرفر الخاص بنا والسيرفر يرد عليه
// بأداة البوستمان الي بيهمنا بشكل مبدئي هو النوع والباث مثلاً هل هو جيت ولا بوست او اي شيء من الموجود بالقائمة المنسدلة والباث العنوان لوكالهوست كولون البورت وبعدها الباث او الروت والي مسنخدمه الأن السلاش
// بننشأ عنصر جديد بالدي بي ارراي بالأندكس زيرو
// Req => Body => raw => JSON
// POST /newElem  add new element
app.post('/newElem',(req, res)=>{
    // localhost:PORT/endpoint
    // localhost:3000/test  نضع هذا الرابط بالمتصفح
    // READ data from front-end [REQ]
    console.log('=======================')
    // console.log(req)
    console.log(req.body)
    // هنا نضيف بميثود البوش للدي بي ارراي
    db.push(req.body)
    res.json('Successed to add new element')
})
// بالتالي طبعلي القيم الجديدة بالكونسول
// الأن روح ارسل حتى تستقبل ريسبونس ما يخص الباث /all
// النتيجة انه ادرج آخر عنصر اضفناه للأرادي دي بي من خلال البوست ميثود
// حفظ معلومات وارجاعها

// من الباك اند للفرونت اند ريسبونس
// من الفرونت اند للباك اند ريكويست

// نروح لتاب البودي بأداة بوست مان حتى نضيف البيانات للدي بي ارراي
// الجزء اليمين الي هو الريسبونس واليسار الريكويست . اتكلم عن اداة البوستمان

// ##########################################################################

// // نجرب put
// نستخدمها لو نبغا نحدث على عنصر معين
// PUT  /firstElem  change fName or any element for the index
// هذا الشيء الجديد اسمه بارام الي بعد الكولون في الباث params
// PUT  /fName/اي اندكس بالأرراي 
app.put('/fName/:index',(req, res)=>{
    // console.log(req.params)
    // db[0] || db[1]    .fName=
    db[req.params.index].fName=req.body.newName
    res.json('Edit fName Successfully')
})
// خلاص كذا الحمد لله زبطها وصار التغيير لقيمة المفتاح الموجود بالأندكس زيرو زي ما كتبنا الباث بالطريقة هذي http://localhost:3000/fName/0 
// // وكتبنا بداخل البودي بالريكويست بأداة البوستمان { "newName":"Mohammad Omar" }   
// وبكذا بعد مارحنا للجيت حتى نجيب الي بداخل الأرراي وحصل التغيير من محمد إلى محمد عمر . 

// // وكمان نجرب delete
// DELETE /firstElem  delete first elem
app.delete('/firstElem',(req, res)=>{
    // localhost:PORT/endpoint
    // localhost:3000/test  نضع هذا الرابط بالمتصفح
    db.shift()
    res.send('Delete the first element successfully')
})
// كل ما تعمل سيند بواجهة اداة البوستمان بيحذف ايليمنت وانت بالديليت ميثود

